// Створити масив, довжину та елементи якого задає користувач.

// Відсортувати масив за зростанням.

// Видалити елементи з масиву з 2 по 4 (включно!).


// У міру змін виводити вміст масиву на сторінку.


let array = [];

let b = prompt('Введите длину массива');

for (let i = 1; i <= b; i++){
let a = prompt('Введите значение:')
    array.push(a)
}
console.log(array, 'Масив, довжина та елементи якого задає користувач.');

array.sort(function (a, b) {
    return a - b
});

console.log(array, 'Відсортованний масив за зростанням.');

array.splice(1,3);

console.log(array, 'Видаленi елементи з масиву з 2 по 4 (включно!)');













// array[a]; // перечитать внимательно что делает эта запись

// // как n-кол-во раз взять данные через пользователя 
// console.log(array);

