// 1

// for (let i = 20; i <= 30; i = i + 0.5){
//     console.log(i);
// }


//2 

// const USD = 27;

// for (let i = 10; i <= 100; i = i + 10){
//   console.log(`${i} долларов равно ` + `${USD} ` * `${i} ` + ' гривен');
// }


//3

// let num = 425;

// for (let i = 0; i <= 100; i++){
//     if (i * i < num) {
//         console.log(i);
//     }
// }

//4 
// let num = prompt('Введите число:');

//   if(num % 2 === 0){ console.log('Составное число');
//   } else {
//   (num > 1, console.log('Простое число'))
// }

// 5 
// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. 
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

// let x = prompt('Введите любое число:');

// if (x % 3 === 0 ) {
//   console.log('Working');
// } else {
//   console.log('Not working');
// }
