// 1 Вивести на сторінку в один рядок через кому числа від 10 до 20.
// let y = ''

// for (let i = 10; i <= 20; i++){
//   y += `${i}, `;
// }
// console.log(y);



// 2 Вивести квадрати чисел від 10 до 20.

// let x; 

// for (let i = 10; i < =20; i++){
//   x = i * i;
//   console.log(x);
// }



// 3 Вивести таблицю множення на 7.

// let seven = 7;
// let result;

// for (let i = 1; i <= 10; i++){
//   result = seven * i;
//   console.log(`${seven} * ${i} = ${result}`);
// }



// 4 Знайти суму всіх цілих чисел від 1 до 15.

// let result = 0;

// for (let i = 1; i <= 15; i++){
//   result += i;
// }

// console.log(result + ' - Сумма всех чисел от 1 до 15 (не включая 15)');



// 5 Знайти добуток усіх цілих чисел від 15 до 35.

// let res = 1

// for (let i = 15; i <= 35; i++){
//   res *= i;
// }
// console.log(res);



// 6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500.

// let res = 0;
// let average;

// for (let i = 1; i <= 500; i++){
//   res += i;
//   average = res / 500;
// }
// console.log(average);



// 7 Вивести суму лише парних чисел в діапазоні від 30 до 80.

// let x = 0;

// for (let i = 30; i <= 80; i++){
//   if (i % 2 === 0) {
//     x = x + i;
//   }
// }
// console.log(x);



// 8 Вивести всі числа в діапазоні від 100 до 200 кратні 3.

// for (let i = 100; i <= 200; i++){
//   if (i % 3 === 0) {
//     console.log(i);
//   }
// }



// 9 Дано натуральне число. Знайти та вивести на сторінку всі його дільники.

// let n = prompt('Введите число:');

// for (let i = 1; i <= n; i++){
//   if (n % i === 0) {
//   console.log(i);
//   }
// }



// 10 Визначити кількість його парних дільників.

// let n = prompt('Введите число:');

// for (let i = 1; i <= n; i++){
//   if (n % i === 0 && i % 2 === 0) {
//   console.log(i);
//   }
// }



// 11 Знайти суму його парних дільників.

// let n = prompt('Введите число:');
// let sum = 0;

// for (let i = 1; i <= n; i++){
//   if (n % i === 0 && i % 2 === 0) {
//     sum = sum + i;
//   }
// }
// console.log(sum + ' cумма парных делителей');



// 12 Надрукувати повну таблицю множення від 1 до 10.
// let res = 0;
// let res2 = 0;

//   for (let i = 1; i <= 10; i++){
//     res = i;
//   for (let j = 1; j <= 10; j++){
//     res2 =  j * i;

//   console.log(`${j} * ${i} = ${res2}` );
//   }
// }